Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0256GPM048.atdf
         <register caption="" name="CCP8RB" offset="0x770" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPB" />
         </register>
         <register caption="" name="CCP9RB" offset="0x870" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPB" />
         </register>
         <register caption="" name="CCP1BUF" offset="0x80" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="BUFL" />
            <bitfield caption="" mask="0xFFFF0000" name="BUFH" />
         </register>
         <register caption="" name="CCP2BUF" offset="0x180" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="BUFL" />
            <bitfield caption="" mask="0xFFFF0000" name="BUFH" />
         </register>
         <register caption="" name="CCP3BUF" offset="0x280" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="BUFL" />
            <bitfield caption="" mask="0xFFFF0000" name="BUFH" />
         </register>
         <register caption="" name="CCP4BUF" offset="0x380" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="BUFL" />
            <bitfield caption="" mask="0xFFFF0000" name="BUFH" />
         </register>
         <register caption="" name="CCP5BUF" offset="0x480" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="BUFL" />
            <bitfield caption="" mask="0xFFFF0000" name="BUFH" />
         </register>
         <register caption="" name="CCP6BUF" offset="0x580" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="BUFL" />
            <bitfield caption="" mask="0xFFFF0000" name="BUFH" />
         </register>
         <register caption="" name="CCP7BUF" offset="0x680" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="BUFL" />
            <bitfield caption="" mask="0xFFFF0000" name="BUFH" />
         </register>
         <register caption="" name="CCP8BUF" offset="0x780" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="BUFL" />
            <bitfield caption="" mask="0xFFFF0000" name="BUFH" />
         </register>
         <register caption="" name="CCP9BUF" offset="0x880" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="BUFL" />
            <bitfield caption="" mask="0xFFFF0000" name="BUFH" />
         </register>
      </register-group>
      <value-group caption="CCPx Time Base Clock Select" name="CCP1CON1__CLKSEL">
         <value caption="System Clock (Fsys)" name="" value="0x0" />
         <value caption="REFCLKO Output Clock" name="" value="0x1" />
         <value caption="Secondary Oscillator Clock (SOSC)" name="" value="0x2" />
         <value caption="CLC1 Output" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="TCKIB Pin (remappable)" name="" value="0x6" />
         <value caption="TCKIA Pin (remappable)" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Time Base Prescale Select" name="CCP1CON1__TMRPS">
         <value caption="1:1 prescale" name="" value="0x0" />
         <value caption="1:4 prescale" name="" value="0x1" />
         <value caption="1:16 prescale" name="" value="0x2" />
         <value caption="1:64 prescale" name="" value="0x3" />
      </value-group>
      <value-group caption="CCPx Synchronization Source Select" name="CCP1CON1__SYNC">
         <value caption="No external synchronization; timer rolls over at FFFFh or matches with the Timer Period register" name="" value="0x0" />
         <value caption="This MCCP/SCCP" name="" value="0x1" />
         <value caption="MCCP1" name="" value="0x2" />
         <value caption="MCCP2" name="" value="0x3" />
         <value caption="MCCP3" name="" value="0x4" />
         <value caption="INT0 pin" name="" value="0x9" />
         <value caption="INT1 pin" name="" value="0xA" />
         <value caption="INT2 pin" name="" value="0xB" />
         <value caption="INT3 pin" name="" value="0xC" />
         <value caption="INT4 pin" name="" value="0xD" />
         <value caption="SCCP8" name="" value="0xE" />
         <value caption="SCCP9" name="" value="0xF" />
         <value caption="CLC1" name="" value="0x10" />
         <value caption="CLC2" name="" value="0x11" />
         <value caption="CLC3" name="" value="0x12" />
         <value caption="CLC4" name="" value="0x13" />
         <value caption="Comparator 1" name="" value="0x18" />
         <value caption="Comparator 2" name="" value="0x19" />
         <value caption="Comparator 3" name="" value="0x1A" />
         <value caption="Start of ADC conversion" name="" value="0x1B" />
         <value caption="Off" name="" value="0x1F" />
      </value-group>
      <value-group caption="CCPx Interrupt Output Postscale Select" name="CCP1CON1__OPS">
         <value caption="Each time base period match or input capture event" name="" value="0x0" />
         <value caption="Every 2nd time base period match or 2nd input capture event" name="" value="0x1" />
         <value caption="Every 3rd time base period match or 3rd input capture event" name="" value="0x2" />
         <value caption="Every 4th time base period match or 4th input capture event" name="" value="0x3" />
         <value caption="Every 5th time base period match" name="" value="0x4" />
         <value caption="Every 6th time base period match" name="" value="0x5" />
         <value caption="Every 7th time base period match" name="" value="0x6" />
         <value caption="Every 8th time base period match" name="" value="0x7" />
         <value caption="Every 9th time base period match" name="" value="0x8" />
         <value caption="Every 10th time base period match" name="" value="0x9" />
         <value caption="Every 11th time base period match" name="" value="0xA" />
         <value caption="Every 12th time base period match" name="" value="0xB" />
         <value caption="Every 13th time base period match" name="" value="0xC" />
         <value caption="Every 14th time base period match" name="" value="0xD" />
         <value caption="Every 15th time base period match" name="" value="0xE" />
         <value caption="Every 16th time base period match" name="" value="0xF" />
      </value-group>
      <value-group caption="CCPx Auto shutdown/Gating Source Enable" name="CCP1CON2__ASDG">
         <value caption="Disabled" name="" value="0x0" />
         <value caption="Comparator 1" name="" value="0x1" />
         <value caption="Comparator 2" name="" value="0x2" />
         <value caption="Comparator 3" name="" value="0x4" />
         <value caption="SCCP5 output" name="" value="0x8" />
         <value caption="SCCP4 output" name="" value="0x10" />
         <value caption="CLC1 output" name="" value="0x20" />
         <value caption="OCFA pin (remappable)" name="" value="0x40" />
         <value caption="OCFB pin (remappable)" name="" value="0x80" />
      </value-group>
