Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0256GPM048.atdf
         <register caption="" name="PMD2" offset="0xcc0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CMP1MD" />
            <bitfield caption="" mask="0x00000002" name="CMP2MD" />
            <bitfield caption="" mask="0x00000004" name="CMP3MD" />
            <bitfield caption="" mask="0x01000000" name="CLC1MD" />
            <bitfield caption="" mask="0x02000000" name="CLC2MD" />
            <bitfield caption="" mask="0x04000000" name="CLC3MD" />
            <bitfield caption="" mask="0x08000000" name="CLC4MD" />
         </register>
         <register caption="" name="PMD3" offset="0xcd0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000100" name="CCP1MD" />
            <bitfield caption="" mask="0x00000200" name="CCP2MD" />
            <bitfield caption="" mask="0x00000400" name="CCP3MD" />
            <bitfield caption="" mask="0x00000800" name="CCP4MD" />
            <bitfield caption="" mask="0x00001000" name="CC5MD" />
            <bitfield caption="" mask="0x00002000" name="CC6MD" />
            <bitfield caption="" mask="0x00004000" name="CC7MD" />
            <bitfield caption="" mask="0x00008000" name="CC8MD" />
            <bitfield caption="" mask="0x00010000" name="CC9MD" />
         </register>
         <register caption="" name="PMD4" offset="0xce0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="T1MD" />
            <bitfield caption="" mask="0x00000002" name="T2MD" />
            <bitfield caption="" mask="0x00000004" name="T3MD" />
         </register>
         <register caption="" name="PMD5" offset="0xcf0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="U1MD" />
            <bitfield caption="" mask="0x00000002" name="U2MD" />
            <bitfield caption="" mask="0x00000004" name="U3MD" />
            <bitfield caption="" mask="0x00000100" name="SPI1MD" />
            <bitfield caption="" mask="0x00000200" name="SPI2MD" />
            <bitfield caption="" mask="0x00000400" name="SPI3MD" />
            <bitfield caption="" mask="0x00010000" name="I2C1MD" />
            <bitfield caption="" mask="0x00020000" name="I2C2MD" />
            <bitfield caption="" mask="0x00040000" name="I2C3MD" />
            <bitfield caption="" mask="0x01000000" name="USBMD" />
         </register>
         <register caption="" name="PMD6" offset="0xd00" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="RTCCMD" />
            <bitfield caption="" mask="0x00000100" name="REFOMD" />
         </register>
         <register caption="" name="PMD7" offset="0xd10" rw="RW" size="4">
            <bitfield caption="" mask="0x00000010" name="DMAMD" />
         </register>
         <register caption="" name="CFGCON" offset="0xd30" rw="RW" size="4">
            <bitfield caption="TDO Enable for 2-Wire JTAG" mask="0x00000001" name="TDOEN" values="CFGCON__TDOEN" />
            <bitfield caption="" mask="0x00000002" name="FAEN" />
            <bitfield caption="JTAG Port Enable bit" mask="0x00000008" name="JTAGEN" values="CFGCON__JTAGEN" />
            <bitfield caption="" mask="0x00000100" name="RPFA" />
            <bitfield caption="" mask="0x00FF0000" name="EXECADDR" />
            <bitfield caption="" mask="0x03000000" name="BMXARB" />
            <bitfield caption="" mask="0x08000000" name="BMXERRDIS" />
         </register>
         <register caption="" name="DEVID" offset="0xd50" rw="R" size="4">
            <bitfield caption="" mask="0x00000FFF" name="MAINID" />
            <bitfield caption="" mask="0x0FFFF000" name="PN" />
            <bitfield caption="" mask="0xF0000000" name="VER" />
         </register>
         <register caption="" name="SYSKEY" offset="0xd60" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="SYSKEY" />
         </register>
         <register caption="" name="ANCFG" offset="0x0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000002" name="BGCMP" />
            <bitfield caption="" mask="0x00000004" name="BGADC" />
         </register>
      </register-group>
      <value-group caption="TDO Enable for 2-Wire JTAG" name="CFGCON__TDOEN">
         <value caption="2-wire JTAG protocol uses TDO" name="" value="0x1" />
         <value caption="2-wire JTAG protocol does not use TDO" name="" value="0x0" />
      </value-group>
      <value-group caption="JTAG Port Enable bit" name="CFGCON__JTAGEN">
         <value caption="Enable the JTAG port" name="" value="0x1" />
         <value caption="Disable the JTAG port" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01577" name="CLC" version="">
      <register-group name="CLC">
         <register caption="" name="CLC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="CLCx Mode bits" mask="0x00000007" name="MODE" values="CLC1CON__MODE" />
            <bitfield caption="CLCx Output Polarity Control bit" mask="0x00000020" name="LCPOL" values="CLC1CON__LCPOL" />
            <bitfield caption="CLCx Data Output Status bit" mask="0x00000040" name="LCOUT" values="CLC1CON__LCOUT" />
            <bitfield caption="CLCx Port Enable bit" mask="0x00000080" name="LCOE" values="CLC1CON__LCOE" />
            <bitfield caption="CLCx Negative Edge Interrupt Enable bit" mask="0x00000400" name="INTN" values="CLC1CON__INTN" />
            <bitfield caption="CLCx Positive Edge Interrupt Enable bit" mask="0x00000800" name="INTP" values="CLC1CON__INTP" />
            <bitfield caption="CLCx Enable bit" mask="0x00008000" name="ON" values="CLC1CON__ON" />
            <bitfield caption="Gate 1 Polarity Control bit" mask="0x00010000" name="G1POL" values="CLC1CON__G1POL" />
            <bitfield caption="Gate 2 Polarity Control bit" mask="0x00020000" name="G2POL" values="CLC1CON__G2POL" />
            <bitfield caption="Gate 3 Polarity Control bit" mask="0x00040000" name="G3POL" values="CLC1CON__G3POL" />
            <bitfield caption="Gate 4 Polarity Control bit" mask="0x00080000" name="G4POL" values="CLC1CON__G4POL" />
         </register>
         <register caption="" name="CLC2CON" offset="0x80" rw="RW" size="4">
            <bitfield caption="CLCx Mode bits" mask="0x00000007" name="MODE" values="CLC2CON__MODE" />
            <bitfield caption="CLCx Output Polarity Control bit" mask="0x00000020" name="LCPOL" values="CLC2CON__LCPOL" />
            <bitfield caption="CLCx Data Output Status bit" mask="0x00000040" name="LCOUT" values="CLC2CON__LCOUT" />
            <bitfield caption="CLCx Port Enable bit" mask="0x00000080" name="LCOE" values="CLC2CON__LCOE" />
            <bitfield caption="CLCx Negative Edge Interrupt Enable bit" mask="0x00000400" name="INTN" values="CLC2CON__INTN" />
            <bitfield caption="CLCx Positive Edge Interrupt Enable bit" mask="0x00000800" name="INTP" values="CLC2CON__INTP" />
            <bitfield caption="CLCx Enable bit" mask="0x00008000" name="ON" values="CLC2CON__ON" />
            <bitfield caption="Gate 1 Polarity Control bit" mask="0x00010000" name="G1POL" values="CLC2CON__G1POL" />
            <bitfield caption="Gate 2 Polarity Control bit" mask="0x00020000" name="G2POL" values="CLC2CON__G2POL" />
            <bitfield caption="Gate 3 Polarity Control bit" mask="0x00040000" name="G3POL" values="CLC2CON__G3POL" />
            <bitfield caption="Gate 4 Polarity Control bit" mask="0x00080000" name="G4POL" values="CLC2CON__G4POL" />
         </register>
         <register caption="" name="CLC3CON" offset="0x100" rw="RW" size="4">
            <bitfield caption="CLCx Mode bits" mask="0x00000007" name="MODE" values="CLC3CON__MODE" />
            <bitfield caption="CLCx Output Polarity Control bit" mask="0x00000020" name="LCPOL" values="CLC3CON__LCPOL" />
            <bitfield caption="CLCx Data Output Status bit" mask="0x00000040" name="LCOUT" values="CLC3CON__LCOUT" />
            <bitfield caption="CLCx Port Enable bit" mask="0x00000080" name="LCOE" values="CLC3CON__LCOE" />
            <bitfield caption="CLCx Negative Edge Interrupt Enable bit" mask="0x00000400" name="INTN" values="CLC3CON__INTN" />
            <bitfield caption="CLCx Positive Edge Interrupt Enable bit" mask="0x00000800" name="INTP" values="CLC3CON__INTP" />
            <bitfield caption="CLCx Enable bit" mask="0x00008000" name="ON" values="CLC3CON__ON" />
            <bitfield caption="Gate 1 Polarity Control bit" mask="0x00010000" name="G1POL" values="CLC3CON__G1POL" />
            <bitfield caption="Gate 2 Polarity Control bit" mask="0x00020000" name="G2POL" values="CLC3CON__G2POL" />
            <bitfield caption="Gate 3 Polarity Control bit" mask="0x00040000" name="G3POL" values="CLC3CON__G3POL" />
            <bitfield caption="Gate 4 Polarity Control bit" mask="0x00080000" name="G4POL" values="CLC3CON__G4POL" />
         </register>
         <register caption="" name="CLC4CON" offset="0x180" rw="RW" size="4">
            <bitfield caption="CLCx Mode bits" mask="0x00000007" name="MODE" values="CLC4CON__MODE" />
            <bitfield caption="CLCx Output Polarity Control bit" mask="0x00000020" name="LCPOL" values="CLC4CON__LCPOL" />
            <bitfield caption="CLCx Data Output Status bit" mask="0x00000040" name="LCOUT" values="CLC4CON__LCOUT" />
            <bitfield caption="CLCx Port Enable bit" mask="0x00000080" name="LCOE" values="CLC4CON__LCOE" />
            <bitfield caption="CLCx Negative Edge Interrupt Enable bit" mask="0x00000400" name="INTN" values="CLC4CON__INTN" />
            <bitfield caption="CLCx Positive Edge Interrupt Enable bit" mask="0x00000800" name="INTP" values="CLC4CON__INTP" />
            <bitfield caption="CLCx Enable bit" mask="0x00008000" name="ON" values="CLC4CON__ON" />
            <bitfield caption="Gate 1 Polarity Control bit" mask="0x00010000" name="G1POL" values="CLC4CON__G1POL" />
            <bitfield caption="Gate 2 Polarity Control bit" mask="0x00020000" name="G2POL" values="CLC4CON__G2POL" />
            <bitfield caption="Gate 3 Polarity Control bit" mask="0x00040000" name="G3POL" values="CLC4CON__G3POL" />
            <bitfield caption="Gate 4 Polarity Control bit" mask="0x00080000" name="G4POL" values="CLC4CON__G4POL" />
         </register>
         <register caption="" name="CLC1SEL" offset="0x10" rw="RW" size="4">
            <bitfield caption="Data Selection MUX 1 Signal Selection bits" mask="0x00000007" name="DS1" values="CLC1SEL__DS1" />
            <bitfield caption="Data Selection MUX 2 Signal Selection bits" mask="0x00000070" name="DS2" values="CLC1SEL__DS2" />
            <bitfield caption="Data Selection MUX 3 Signal Selection bits" mask="0x00000700" name="DS3" values="CLC1SEL__DS3" />
            <bitfield caption="Data Selection MUX 4 Signal Selection bits" mask="0x00007000" name="DS4" values="CLC1SEL__DS4" />
         </register>
         <register caption="" name="CLC2SEL" offset="0x90" rw="RW" size="4">
            <bitfield caption="Data Selection MUX 1 Signal Selection bits" mask="0x00000007" name="DS1" values="CLC2SEL__DS1" />
            <bitfield caption="Data Selection MUX 2 Signal Selection bits" mask="0x00000070" name="DS2" values="CLC2SEL__DS2" />
            <bitfield caption="Data Selection MUX 3 Signal Selection bits" mask="0x00000700" name="DS3" values="CLC2SEL__DS3" />
            <bitfield caption="Data Selection MUX 4 Signal Selection bits" mask="0x00007000" name="DS4" values="CLC2SEL__DS4" />
         </register>
