Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0256GPM048.atdf
      <value-group caption="Gate 4 Polarity Control bit" name="CLC4CON__G4POL">
         <value caption="The output of Channel 4 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 4 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 1 Signal Selection bits" name="CLC1SEL__DS1">
         <value caption="MCCP1 OCM1C Output" name="" value="0x7" />
         <value caption="MCCP1 OCM1B Output" name="" value="0x6" />
         <value caption="MCCP1 OCM1A Output" name="" value="0x5" />
         <value caption="REFO1 Clock Output" name="" value="0x4" />
         <value caption="LPRC Clock" name="" value="0x3" />
         <value caption="SOSC Clock" name="" value="0x2" />
         <value caption="System Clock" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 2 Signal Selection bits" name="CLC1SEL__DS2">
         <value caption="Unused" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="DMA Channel 0 interrupt" name="" value="0x5" />
         <value caption="ADC End of Conversion" name="" value="0x4" />
         <value caption="UART1 TX Out" name="" value="0x3" />
         <value caption="CMP1 out" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC1SEL__DS3">
         <value caption="SCCP5 OCMP compare match event" name="" value="0x7" />
         <value caption="SCCP4 OCMP compare match event" name="" value="0x6" />
         <value caption="SCCP4 OCM4 output" name="" value="0x5" />
         <value caption="UART1 RX In" name="" value="0x4" />
         <value caption="SPI1 SDO1 Out" name="" value="0x3" />
         <value caption="CMP2 out" name="" value="0x2" />
         <value caption="CLC1 Out" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC1SEL__DS4">
         <value caption="SCCP5 OCMP compare match event" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="RTCC event" name="" value="0x5" />
         <value caption="CMP3 out" name="" value="0x4" />
         <value caption="SPI1 SDI1 in" name="" value="0x3" />
         <value caption="SCCP5 OCM5 output" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 1 Signal Selection bits" name="CLC2SEL__DS1">
         <value caption="MCCP1 OCM1F Output" name="" value="0x7" />
         <value caption="MCCP1 OCM1E Output" name="" value="0x6" />
         <value caption="MCCP1 OCM1D Output" name="" value="0x5" />
         <value caption="REFO1 Clock Output" name="" value="0x4" />
         <value caption="LPRC Clock" name="" value="0x3" />
         <value caption="SOSC Clock" name="" value="0x2" />
         <value caption="System Clock" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 2 Signal Selection bits" name="CLC2SEL__DS2">
         <value caption="Unused" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="DMA Channel 1 interrupt" name="" value="0x5" />
         <value caption="ADC End of Conversion" name="" value="0x4" />
         <value caption="UART2 TX Out" name="" value="0x3" />
         <value caption="CMP1 out" name="" value="0x2" />
         <value caption="CLC1 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC2SEL__DS3">
         <value caption="SCCP5 OCMP compare match event" name="" value="0x7" />
         <value caption="SCCP4 OCMP compare match event" name="" value="0x6" />
         <value caption="SCCP4 OCM4 output" name="" value="0x5" />
         <value caption="UART2 RX In" name="" value="0x4" />
         <value caption="SPI2 SDO2 Out" name="" value="0x3" />
         <value caption="CMP2 out" name="" value="0x2" />
         <value caption="CLC2 Out" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC2SEL__DS4">
         <value caption="SCCP5 OCMP compare match event" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="RTCC event" name="" value="0x5" />
         <value caption="CMP3 out" name="" value="0x4" />
         <value caption="SPI2 SDI2 in" name="" value="0x3" />
         <value caption="SCCP5 OCM5 Output" name="" value="0x2" />
         <value caption="CLC1 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 1 Signal Selection bits" name="CLC3SEL__DS1">
         <value caption="MCCP2 OCM1C Output" name="" value="0x7" />
         <value caption="MCCP2 OCM1B Output" name="" value="0x6" />
         <value caption="MCCP2 OCM1A Output" name="" value="0x5" />
         <value caption="REFO1 Clock Output" name="" value="0x4" />
         <value caption="LPRC Clock" name="" value="0x3" />
         <value caption="SOSC Clock" name="" value="0x2" />
         <value caption="System Clock" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 2 Signal Selection bits" name="CLC3SEL__DS2">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="MCCP2 OCMP compare match event" name="" value="0x6" />
         <value caption="DMA channel 0 interrupt" name="" value="0x5" />
         <value caption="ADC End of Conversion" name="" value="0x4" />
         <value caption="UART3 TX Out" name="" value="0x3" />
         <value caption="CMP1 out" name="" value="0x2" />
         <value caption="CLC4 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
