Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0256GPM048.atdf
      <value-group caption="Acknowledge Status bit (when operating as I2C master, applicable to master transmit operation)" name="I2C2STAT__ACKSTAT">
         <value caption="Acknowledge was not received from slave" name="" value="0x1" />
         <value caption="Acknowledge was received from slave" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit" name="I2C3STAT__TBF">
         <value caption="Transmit in progress I2CxTRN is full" name="" value="0x1" />
         <value caption="Transmit complete I2CxTRN is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Full Status bit" name="I2C3STAT__RBF">
         <value caption="Receive complete I2CxRCV is full" name="" value="0x1" />
         <value caption="Receive not complete I2CxRCV is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Read/Write Information bit (when operating as I2C slave)" name="I2C3STAT__R_W">
         <value caption="Read indicates data transfer is output from slave" name="" value="0x1" />
         <value caption="Write indicates data transfer is input to slave" name="" value="0x0" />
      </value-group>
      <value-group caption="Start bit" name="I2C3STAT__S">
         <value caption="Indicates that a Start (or Repeated Start) bit has been detected last" name="" value="0x1" />
         <value caption="Start bit was not detected last" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop bit" name="I2C3STAT__P">
         <value caption="Indicates that a Stop bit has been detected last" name="" value="0x1" />
         <value caption="Stop bit was not detected last" name="" value="0x0" />
      </value-group>
      <value-group caption="Data/Address bit (when operating as I2C slave)" name="I2C3STAT__D_A">
         <value caption="Indicates that the last byte received was data" name="" value="0x1" />
         <value caption="Indicates that the last byte received was device address" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="I2C3STAT__I2COV">
         <value caption="A byte was received while the I2CxRCV register is still holding the previous byte" name="" value="0x1" />
         <value caption="No overflow" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Collision Detect bit" name="I2C3STAT__IWCOL">
         <value caption="An attempt to write the I2CxTRN register failed because the I2C module is busy" name="" value="0x1" />
         <value caption="No collision" name="" value="0x0" />
      </value-group>
      <value-group caption="10-bit Address Status bit" name="I2C3STAT__ADD10">
         <value caption="10-bit address was matched" name="" value="0x1" />
         <value caption="10-bit address was not matched" name="" value="0x0" />
      </value-group>
      <value-group caption="General Call Status bit" name="I2C3STAT__GCSTAT">
         <value caption="General call address was received" name="" value="0x1" />
         <value caption="General call address was not received" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Bus Collision Detect bit" name="I2C3STAT__BCL">
         <value caption="A bus collision has been detected during a master operation" name="" value="0x1" />
         <value caption="No collision" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Status bit (when operating as I2C master, applicable to master transmit operation)" name="I2C3STAT__TRSTAT">
         <value caption="Master transmit is in progress (8 bits + ACK)" name="" value="0x1" />
         <value caption="Master transmit is not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Acknowledge Status bit (when operating as I2C master, applicable to master transmit operation)" name="I2C3STAT__ACKSTAT">
         <value caption="Acknowledge was not received from slave" name="" value="0x1" />
         <value caption="Acknowledge was received from slave" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02922" name="INT" version="">
      <register-group name="INT">
         <register caption="Interrupt Control Register" name="INTCON" offset="0x8090" rw="RW" size="4">
            <bitfield caption="External Interrupt 0 Edge" mask="0x00000001" name="INT0EP" values="INTCON__INT0EP" />
            <bitfield caption="External Interrupt 1 Edge" mask="0x00000002" name="INT1EP" values="INTCON__INT1EP" />
            <bitfield caption="External Interrupt 2 Edge" mask="0x00000004" name="INT2EP" values="INTCON__INT2EP" />
            <bitfield caption="External Interrupt 3 Edge" mask="0x00000008" name="INT3EP" values="INTCON__INT3EP" />
            <bitfield caption="External Interrupt 4 Edge" mask="0x00000010" name="INT4EP" values="INTCON__INT4EP" />
            <bitfield caption="Interrupt Proximity Timer Control bits" mask="0x00000700" name="TPC" values="INTCON__TPC" />
            <bitfield caption="Multi Vector Configuration bit" mask="0x00001000" name="MVEC" values="INTCON__MVEC" />
            <bitfield caption="" mask="0x007F0000" name="VS" />
         </register>
         <register caption="" name="PRISS" offset="0x80a0" rw="RW" size="4">
            <bitfield caption="Single Vector Shadow Register Set bit" mask="0x00000001" name="SS0" values="PRISS__SS0" />
            <bitfield caption="" mask="0x00000010" name="PRI1SS" />
            <bitfield caption="" mask="0x00000100" name="PRI2SS" />
            <bitfield caption="" mask="0x00001000" name="PRI3SS" />
            <bitfield caption="" mask="0x00010000" name="PRI4SS" />
            <bitfield caption="" mask="0x00100000" name="PRI5SS" />
            <bitfield caption="" mask="0x01000000" name="PRI6SS" />
            <bitfield caption="" mask="0x10000000" name="PRI7SS" />
         </register>
         <register caption="Interrupt Status Register" name="INTSTAT" offset="0x80b0" rw="R" size="4">
            <bitfield caption="" mask="0x000000FF" name="SIRQ" />
            <bitfield caption="" mask="0x00000700" name="SRIPL" />
         </register>
         <register caption="" name="IPTMR" offset="0x80c0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="IPTMR" />
         </register>
         <register caption="" name="IFS0" offset="0x80d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CTIF" />
            <bitfield caption="" mask="0x00000002" name="CS0IF" />
            <bitfield caption="" mask="0x00000004" name="CS1IF" />
            <bitfield caption="" mask="0x00000008" name="INT0IF" />
            <bitfield caption="" mask="0x00000010" name="INT1IF" />
            <bitfield caption="" mask="0x00000020" name="INT2IF" />
            <bitfield caption="" mask="0x00000040" name="INT3IF" />
            <bitfield caption="" mask="0x00000080" name="INT4IF" />
            <bitfield caption="" mask="0x00000100" name="CNAIF" />
            <bitfield caption="" mask="0x00000200" name="CNBIF" />
            <bitfield caption="" mask="0x00000400" name="CNCIF" />
            <bitfield caption="" mask="0x00000800" name="CNDIF" />
            <bitfield caption="" mask="0x00020000" name="T1IF" />
            <bitfield caption="" mask="0x00040000" name="T2IF" />
            <bitfield caption="" mask="0x00080000" name="T3IF" />
            <bitfield caption="" mask="0x00800000" name="CMP1IF" />
            <bitfield caption="" mask="0x01000000" name="CMP2IF" />
            <bitfield caption="" mask="0x02000000" name="CMP3IF" />
            <bitfield caption="" mask="0x20000000" name="USBIF" />
         </register>
         <register caption="" name="IFS1" offset="0x80e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="RTCCIF" />
            <bitfield caption="" mask="0x00000002" name="AD1IF" />
            <bitfield caption="" mask="0x00000010" name="LVDIF" />
            <bitfield caption="" mask="0x00000020" name="CLC1IF" />
            <bitfield caption="" mask="0x00000040" name="CLC2IF" />
            <bitfield caption="" mask="0x00000080" name="CLC3IF" />
            <bitfield caption="" mask="0x00000100" name="CLC4IF" />
            <bitfield caption="" mask="0x00000200" name="SPI1EIF" />
            <bitfield caption="" mask="0x00000400" name="SPI1TXIF" />
            <bitfield caption="" mask="0x00000800" name="SPI1RXIF" />
            <bitfield caption="" mask="0x00001000" name="SPI2EIF" />
            <bitfield caption="" mask="0x00002000" name="SPI2TXIF" />
            <bitfield caption="" mask="0x00004000" name="SPI2RXIF" />
            <bitfield caption="" mask="0x00008000" name="SPI3EIF" />
            <bitfield caption="" mask="0x00010000" name="SPI3TXIF" />
            <bitfield caption="" mask="0x00020000" name="SPI3RXIF" />
            <bitfield caption="" mask="0x00200000" name="U1RXIF" />
            <bitfield caption="" mask="0x00400000" name="U1TXIF" />
            <bitfield caption="" mask="0x00800000" name="U1EIF" />
            <bitfield caption="" mask="0x01000000" name="U2RXIF" />
            <bitfield caption="" mask="0x02000000" name="U2TXIF" />
            <bitfield caption="" mask="0x04000000" name="U2EIF" />
            <bitfield caption="" mask="0x08000000" name="U3RXIF" />
            <bitfield caption="" mask="0x10000000" name="U3TXIF" />
            <bitfield caption="" mask="0x20000000" name="U3EIF" />
         </register>
